%problem1：描绘钢材形状。
clear;clc;
x=[180473
180523
180884
180835
180473
180473
];
y=[-741
-741
-462
-342
-342
-741
];
p1=[180473 180473 180884 180884 180473];
q1=[-741 -342 -342 -741 -741];
figure(1)
line(x,y)
fill(x,y,'g');
line(p1,q1,'LineWidth',2)
title('五边形')
hold on

a=[1570
1920
1920
1770
1770
1570
1570
];
b=[1688
1688
1438
1438
1288
1288
1688
];
p2=[1570 1570 1920 1920 1570];
q2=[1288 1688 1688 1288 1288];
figure(2)
line(a,b)
fill(a,b,'g');
line(p2,q2,'LineWidth',2)
title('六边形')
hold on

% c=[0
% 350
% 350
% 0
% 0
% ];
% d=[0
% 0
% 200
% 200
% 0
% ];
% figure(3)
% plot(c,d)
% hold on




% %设置矩形左下角的顶点坐标
% ax = 1;
% ay = 1;
% %设置矩形长宽
% l = 3;
% w = 4;
% x = [ax,ax+l,ax+l,ax,ax];
% y = [ay,ay,ay+w,ay+w,ay];
% %绘图
% line(x,y)
% %也可以用plot
% plot(x,y)
% %为方便观察将坐标轴设置2倍长宽
% axis([ax-l,ax+2*l,ay-w,ay+2*w])