%------------------------------------------------------------------------
%例：将4 个图形显示在同一个图形窗口中。
% subplot(m,n,p)：把窗口分成m×n个小窗口，并把第p个窗口当作当前窗口。
%------------------------------------------------------------------------

t=0:pi/20:2*pi; [x,y]=meshgrid(t); 

subplot(2,2,1); plot(sin(t),cos(t)); 
axis equal  %使坐标轴刻度增量相同
% axis square：使各坐标轴长度相同，但刻度增量未必相同

subplot(2,2,2); z=sin(x)+cos(y); 
plot(t,z); axis([0,2*pi,-2,2])

subplot(2,2,3); z=sin(x).*cos(y); 
plot(t,z); axis([0,2*pi,-1,1])

subplot(2,2,4); z=sin(x).^2-cos(y).^2; 
plot(t,z); axis([0,2*pi,-1,1])