%求及格区间（正态分布）
%2015年5月11日16:26:54

%为了增加区间可信度，去掉原数据的最大值和最小值。
A=[58.812	60.792	61.98	63.168	63.564	65.13	65.658	65.922	66.084	66.714	66.714	66.714	66.876	67.11	67.668	68.562	70.422	70.818	70.818];
alpha=0.001;
% 判断数据在99.9%置信水平下，是否符合正态分布。
[mu, sigma] = normfit(A);
p1 = normcdf(A, mu, sigma);
[H1,s1] = kstest(A, [A, p1], alpha);
n = length(A);
if H1 == 0
    disp('该数据源服从正态分布。')
else
    disp('该数据源不服从正态分布。')
end
%把数据拟合成正态分布，并求出其均值、方差。
[mu,sig,muci,sigci]=normfit(A,alpha)
%根据所求均值和方差，求出对应区间在总的数据中所占的比重，即可信度。
P1=normcdf(58,mu,sig)
P2=normcdf(70,mu,sig)
P=(P2-P1)*100

