%求优秀区间（正态分布）
%2015年5月11日16:26:54

%为了增加区间可信度，去掉原数据的最大值和最小值。
A=[77.64	78	79.74	79.836	79.848	79.848	80.164	80.376	81.736	81.948	82.372	82.476	82.476	82.476	82.9	83.152	83.944	84.208	84.208	84.472	84.736	85];
alpha=0.001;
% 判断数据在99.9%置信水平下，是否符合正态分布。
[mu, sigma] = normfit(A);
p1 = normcdf(A, mu, sigma);
[H1,s1] = kstest(A, [A, p1], alpha);
n = length(A);
if H1 == 0
    disp('该数据源服从正态分布。')
else
    disp('该数据源不服从正态分布。')
end
%求出对应点的概率
[mu,sig,muci,sigci]=normfit(A,alpha)
%把数据拟合成正态分布，并求出其均值、方差。
P1=normcdf(79,mu,sig)
P2=normcdf(100,mu,sig)
%根据所求均值和方差，求出对应区间在总的数据中所占的比重，即可信度。
P=(P2-P1)*100