%“灰色预测模型”预测海平面高度
clear
syms a b;
c=[a b]';
A=[52 53 54 55 60 51 56 61 68 55 44 76 48 75 91 64 93 153 115];
B=cumsum(A); % AGO生成数列，原始数据累加（B(i+2)=B(i+1)+B(i)）。
n=length(A);
for i=1:(n-1)
    C(i)=(B(i)+B(i+1))/2; % 生成累加矩阵
end     
% 计算待定参数的值
D=A;D(1)=[];
D=D';
E=[-C;ones(1,n-1)];
c=inv(E*E')*E*D;
c=c';
a=c(1);b=c(2);
% 预测后续数据
F=[];F(1)=A(1);
for i=2:(n+40)
    F(i)=(A(1)-b/a)/exp(a*(i-1))+b/a ;
end
G=[];G(1)=A(1);
for i=2:(n+40)
    G(i)=F(i)-F(i-1); %得到预测出来的数据
end
t1=1995:2013;
t2=1995:2053;
G
plot(t1,A,'-*',t2,G,'-o') %原始数据与预测数据的比较
xlabel('年份/year')
ylabel('海平面高度/mm')
title('“灰色预测模型”预测海平面高度')
legend('实际值','预测值',2);