%% 污染分布图：正态分布。
clear,clc;
x1=0:50:5000;
y1=-2000:50:2000;
[x,y]=meshgrid(x1,y1); %设定网格，下风向排放点距离x米，烟气中心轴水平距离y米

%由选用的标准,然后查表得。
% alpha_1=0.888723;
% gamma_1=0.146669;
% alpha_2=0.55536;
% gamma_2=0.810763;
sigma_x=0.08.*x./((1+0.0001*x).^0.5);%水平扩散系数
sigma_y=0.06.*x./((1+0.0015*x).^0.5);%垂直扩散系数

sigma_r=(sigma_x.^2+sigma_y.^2).^0.5;

f=(1./((2*pi).^0.5.*sigma_r)).*(exp((x.^2+y.^2)./(2.*(sigma_x.^2+sigma_y.^2))));

%% 画图。
% 三维曲面图，可以用surf或mesh命令；
% 三维曲线图，可以用plot3命令。
mesh(x,y,f);

%% 求出51公里处，污染源浓度。
%f51=(1/(sqrt(2*pi)*sigma_r))*(exp(-power(51-Ur,2)/(2*power(sigma_r,2))));